
&НаКлиенте
Процедура СтрокаСоединенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Попытка
		Datalinks = Новый COMОбъект("Datalinks");
		Connection = Новый COMОбъект("ADODB.Connection");
		СтрокаУДЛ = СокрЛП(СтрокаСоединения);

		Connection.ConnectionString = СтрокаУДЛ;
		Datalinks.PromptEdit(Connection);

		Если СокрЛП(Connection.ConnectionString)<>СтрокаУДЛ Тогда
				СтрокаСоединения = СокрЛП(Connection.ConnectionString);
		КонецЕсли;
    Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		Возврат;
	КонецПопытки;
	
КонецПроцедуры
